---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.StructuralUsage
zh: 族实例
source: html/52fe2ab8-d038-df14-fb12-e4f9c036dd7d.htm
---
# Autodesk.Revit.DB.FamilyInstance.StructuralUsage Property

**中文**: 族实例

Provides the primary structural usage of the instance, such as brace, girder etc.

## Syntax (C#)
```csharp
public StructuralInstanceUsage StructuralUsage { get; set; }
```